{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 47,
   "metadata": {},
   "outputs": [],
   "source": [
    "import neo4j\n",
    "import pyvis\n",
    "import numpy as np"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "metadata": {},
   "outputs": [],
   "source": [
    "uri = 'bolt://localhost:7687'\n",
    "auth = ('neo4j', 'password')\n",
    "db = neo4j.GraphDatabase.driver(uri, auth=auth)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "EagerResult(records=[], summary=<neo4j._work.summary.ResultSummary object at 0x7f8bbfb03290>, keys=[])"
      ]
     },
     "execution_count": 49,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "db.execute_query(\n",
    "    '''\n",
    "    WITH \"https://raw.githubusercontent.com/neo4j-graph-analytics/book/master/data/\" AS base\n",
    "    WITH base + \"social-nodes.csv\" AS uri\n",
    "    LOAD CSV WITH HEADERS FROM uri AS row\n",
    "    MERGE (:User {id: row.id})\n",
    "    '''\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "EagerResult(records=[], summary=<neo4j._work.summary.ResultSummary object at 0x7f8bbfb00a10>, keys=[])"
      ]
     },
     "execution_count": 50,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "db.execute_query(\n",
    "    '''\n",
    "    WITH \"https://raw.githubusercontent.com/neo4j-graph-analytics/book/master/data/\" AS base\n",
    "    WITH base + \"social-relationships.csv\" AS uri\n",
    "    LOAD CSV WITH HEADERS FROM uri AS row\n",
    "    MATCH (source:User {id: row.src})\n",
    "    MATCH (destination:User {id: row.dst})\n",
    "    MERGE (source)-[:FOLLOWS]->(destination)\n",
    "    '''\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>s_id</th>\n",
       "      <th>d_id</th>\n",
       "      <th>rel_type</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Alice</td>\n",
       "      <td>Doug</td>\n",
       "      <td>FOLLOWS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Alice</td>\n",
       "      <td>Michael</td>\n",
       "      <td>FOLLOWS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Alice</td>\n",
       "      <td>Charles</td>\n",
       "      <td>FOLLOWS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Alice</td>\n",
       "      <td>Bridget</td>\n",
       "      <td>FOLLOWS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Bridget</td>\n",
       "      <td>Doug</td>\n",
       "      <td>FOLLOWS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Bridget</td>\n",
       "      <td>Alice</td>\n",
       "      <td>FOLLOWS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Bridget</td>\n",
       "      <td>Michael</td>\n",
       "      <td>FOLLOWS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Charles</td>\n",
       "      <td>Doug</td>\n",
       "      <td>FOLLOWS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Doug</td>\n",
       "      <td>Mark</td>\n",
       "      <td>FOLLOWS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Mark</td>\n",
       "      <td>Alice</td>\n",
       "      <td>FOLLOWS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Mark</td>\n",
       "      <td>Doug</td>\n",
       "      <td>FOLLOWS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Michael</td>\n",
       "      <td>Doug</td>\n",
       "      <td>FOLLOWS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Michael</td>\n",
       "      <td>Bridget</td>\n",
       "      <td>FOLLOWS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Michael</td>\n",
       "      <td>Alice</td>\n",
       "      <td>FOLLOWS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>David</td>\n",
       "      <td>Amy</td>\n",
       "      <td>FOLLOWS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>James</td>\n",
       "      <td>David</td>\n",
       "      <td>FOLLOWS</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       s_id     d_id rel_type\n",
       "0     Alice     Doug  FOLLOWS\n",
       "1     Alice  Michael  FOLLOWS\n",
       "2     Alice  Charles  FOLLOWS\n",
       "3     Alice  Bridget  FOLLOWS\n",
       "4   Bridget     Doug  FOLLOWS\n",
       "5   Bridget    Alice  FOLLOWS\n",
       "6   Bridget  Michael  FOLLOWS\n",
       "7   Charles     Doug  FOLLOWS\n",
       "8      Doug     Mark  FOLLOWS\n",
       "9      Mark    Alice  FOLLOWS\n",
       "10     Mark     Doug  FOLLOWS\n",
       "11  Michael     Doug  FOLLOWS\n",
       "12  Michael  Bridget  FOLLOWS\n",
       "13  Michael    Alice  FOLLOWS\n",
       "14    David      Amy  FOLLOWS\n",
       "15    James    David  FOLLOWS"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "users_df = db.execute_query(\n",
    "    '''\n",
    "    MATCH (s:User)-[f]->(d:User)\n",
    "    RETURN s.id as s_id, d.id as d_id, TYPE(f) as rel_type\n",
    "    ''',\n",
    "    result_transformer_=neo4j.Result.to_df)\n",
    "\n",
    "display(users_df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "EagerResult(records=[<Record g={'relationshipCount': 16, 'graphName': 'users', 'query': \"\\n    MATCH (s:User)-[r:FOLLOWS]->(t:User)\\n    WITH gds.graph.project('users', s, t) AS g\\n    RETURN g\\n    \", 'projectMillis': 2369, 'configuration': {'readConcurrency': 4, 'undirectedRelationshipTypes': [], 'jobId': '406daa32-1b06-4030-b8a3-c10172353279', 'logProgress': True, 'query': \"\\n    MATCH (s:User)-[r:FOLLOWS]->(t:User)\\n    WITH gds.graph.project('users', s, t) AS g\\n    RETURN g\\n    \", 'inverseIndexedRelationshipTypes': [], 'creationTime': neo4j.time.DateTime(2024, 2, 2, 12, 1, 40, 112162674, tzinfo=<UTC>)}, 'nodeCount': 9}>], summary=<neo4j._work.summary.ResultSummary object at 0x7f8bbfaf5890>, keys=['g'])"
      ]
     },
     "execution_count": 52,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "user_graph_exists_result = db.execute_query(\n",
    "    '''\n",
    "    CALL gds.graph.exists('users')\n",
    "    YIELD exists\n",
    "    RETURN exists\n",
    "    ''')\n",
    "\n",
    "user_graph_exists = user_graph_exists_result.records[0].get('exists')\n",
    "\n",
    "if user_graph_exists:\n",
    "    db.execute_query(\n",
    "        '''\n",
    "        CALL gds.graph.drop('users')\n",
    "        '''\n",
    "    )\n",
    "\n",
    "db.execute_query(\n",
    "    '''\n",
    "    MATCH (s:User)-[r:FOLLOWS]->(t:User)\n",
    "    WITH gds.graph.project('users', s, t) AS g\n",
    "    RETURN g\n",
    "    ''')\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Calculate Degree Centrality"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 53,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>followers</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Alice</td>\n",
       "      <td>7.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Doug</td>\n",
       "      <td>6.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Michael</td>\n",
       "      <td>5.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Bridget</td>\n",
       "      <td>5.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Mark</td>\n",
       "      <td>3.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>David</td>\n",
       "      <td>2.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Charles</td>\n",
       "      <td>2.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>James</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Amy</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "      name  followers\n",
       "0    Alice        7.0\n",
       "1     Doug        6.0\n",
       "2  Michael        5.0\n",
       "3  Bridget        5.0\n",
       "4     Mark        3.0\n",
       "5    David        2.0\n",
       "6  Charles        2.0\n",
       "7    James        1.0\n",
       "8      Amy        1.0"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# From the docs, the use of the 'UNDIRECTED' orientation uses both the in-degree and the outdegree to calculate the cenrtality degree.\n",
    "\n",
    "degree_centrality_df = db.execute_query(\n",
    "    '''\n",
    "    CALL gds.degree.stream('users', { orientation: 'UNDIRECTED' })\n",
    "    YIELD nodeId, score\n",
    "    RETURN gds.util.asNode(nodeId).id as name, score as followers\n",
    "    ORDER BY followers DESC, name DESC\n",
    "    ''',\n",
    "    result_transformer_=neo4j.Result.to_df)\n",
    "\n",
    "display(degree_centrality_df)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Calculate Closeness Centrality"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>centrallity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Doug</td>\n",
       "      <td>0.625000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Alice</td>\n",
       "      <td>0.390625</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Mark</td>\n",
       "      <td>0.347222</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Charles</td>\n",
       "      <td>0.312500</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Michael</td>\n",
       "      <td>0.284091</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Bridget</td>\n",
       "      <td>0.284091</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Amy</td>\n",
       "      <td>0.166667</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>David</td>\n",
       "      <td>0.125000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>James</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "      name  centrallity\n",
       "0     Doug     0.625000\n",
       "1    Alice     0.390625\n",
       "2     Mark     0.347222\n",
       "3  Charles     0.312500\n",
       "4  Michael     0.284091\n",
       "5  Bridget     0.284091\n",
       "6      Amy     0.166667\n",
       "7    David     0.125000\n",
       "8    James     0.000000"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "closeness_centrality_df = db.execute_query(\n",
    "    '''\n",
    "    CALL gds.closeness.stream('users', {useWassermanFaust: true})\n",
    "    YIELD nodeId, score\n",
    "    RETURN gds.util.asNode(nodeId).id as name, score as centrallity\n",
    "    ORDER BY centrallity DESC, name DESC\n",
    "    ''',\n",
    "    result_transformer_=neo4j.Result.to_df)\n",
    "\n",
    "display(closeness_centrality_df)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Calculate Harmonic Centrality"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 55,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>centrallity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Doug</td>\n",
       "      <td>0.625000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Alice</td>\n",
       "      <td>0.479167</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Michael</td>\n",
       "      <td>0.385417</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Bridget</td>\n",
       "      <td>0.385417</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Mark</td>\n",
       "      <td>0.375000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Charles</td>\n",
       "      <td>0.354167</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Amy</td>\n",
       "      <td>0.187500</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>David</td>\n",
       "      <td>0.125000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>James</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "      name  centrallity\n",
       "0     Doug     0.625000\n",
       "1    Alice     0.479167\n",
       "2  Michael     0.385417\n",
       "3  Bridget     0.385417\n",
       "4     Mark     0.375000\n",
       "5  Charles     0.354167\n",
       "6      Amy     0.187500\n",
       "7    David     0.125000\n",
       "8    James     0.000000"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "closeness_centrality_df = db.execute_query(\n",
    "    '''\n",
    "    CALL gds.closeness.harmonic.stream('users')\n",
    "    YIELD nodeId, score\n",
    "    RETURN gds.util.asNode(nodeId).id as name, score as centrallity\n",
    "    ORDER BY centrallity DESC, name DESC\n",
    "    ''',\n",
    "    result_transformer_=neo4j.Result.to_df)\n",
    "\n",
    "display(closeness_centrality_df)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Calculate Betweeness Centrality"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>centrallity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Alice</td>\n",
       "      <td>10.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Mark</td>\n",
       "      <td>7.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Doug</td>\n",
       "      <td>7.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>David</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Michael</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>James</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Charles</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Bridget</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Amy</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "      name  centrallity\n",
       "0    Alice         10.0\n",
       "1     Mark          7.0\n",
       "2     Doug          7.0\n",
       "3    David          1.0\n",
       "4  Michael          0.0\n",
       "5    James          0.0\n",
       "6  Charles          0.0\n",
       "7  Bridget          0.0\n",
       "8      Amy          0.0"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "betweeness_centrality_df = db.execute_query(\n",
    "    '''\n",
    "    CALL gds.betweenness.stream('users')\n",
    "    YIELD nodeId, score\n",
    "    RETURN gds.util.asNode(nodeId).id as name, score as centrallity\n",
    "    ORDER BY centrallity DESC, name DESC\n",
    "    ''',\n",
    "    result_transformer_=neo4j.Result.to_df)\n",
    "\n",
    "display(betweeness_centrality_df)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
